# PhaseArray Constructor (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PhaseArray Constructor
PhaseArray Class See Also
---
Initializes a new instance of the PhaseArray class
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public PhaseArray()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
PhaseArray()
```

# See Also
PhaseArray Class
Autodesk.Revit.DB Namespace